{
  "help": {
    "desc": "Display all available commands or get help for a specific command",
    "usage": "help [command]",
    "man": "The help command displays a comprehensive list of all available terminal commands organized by category. When used without arguments, it shows the complete command reference. When a specific command name is provided as an argument, it displays detailed information about that command including its description and usage. This is the primary way to discover and learn about terminal functionality.",
    "examples": ["help", "help ls", "help grep"]
  },
  "session": {
    "desc": "Save, load, list, or delete terminal sessions",
    "usage": "session <save|load|list|delete> [name]",
    "man": "The session command allows you to manage terminal sessions. You can save your current terminal state including path, history, user settings, theme, and widget layout with a custom name. Later, you can restore any saved session to return to that exact state. The 'list' action shows all saved sessions with timestamps, and 'delete' removes a specific session. This is useful for maintaining different work contexts or preserving important terminal states.",
    "examples": [
      "session save mywork",
      "session load mywork",
      "session list",
      "session delete mywork"
    ]
  },
  "set": {
    "desc": "Configure terminal settings like font size, opacity, prompt, startup command, or boot sequence",
    "usage": "set <property> <value>",
    "man": "The set command is used to customize terminal appearance and behavior. Properties include 'fontSize' (8-40px), 'opacity' (0.0-1.0 for transparency), 'prompt' (custom prompt text or 'default' to reset), 'startupCmd' (command to run on startup or 'none'), and 'boot' (on/off to enable/disable boot sequence). Changes are saved automatically and persist across sessions.",
    "examples": [
      "set fontSize 16",
      "set opacity 0.8",
      "set prompt cyber>",
      "set startupCmd neofetch",
      "set boot off"
    ]
  },
  "refresh": {
    "desc": "Reload the terminal page",
    "usage": "refresh",
    "man": "The refresh command initiates a full page reload, similar to pressing F5 in your browser. It displays a brief message before reloading, giving you time to see the confirmation. This is useful when you want to reset the terminal to a clean state or apply certain configuration changes that require a page refresh.",
    "examples": ["refresh"]
  },
  "reboot": {
    "desc": "Alias for refresh - reload the terminal page",
    "usage": "reboot",
    "man": "The reboot command is functionally identical to the refresh command. It reloads the entire terminal page, resetting the environment. This command provides a more traditional Unix-like terminology for users who prefer 'reboot' over 'refresh'.",
    "examples": ["reboot"]
  },
  "settings": {
    "desc": "Export, import, or reset terminal settings",
    "usage": "settings <export|import|reset>",
    "man": "The settings command manages your terminal configuration. 'export' saves all current settings to a JSON file that you can download. 'import' allows you to upload a previously exported settings file to restore your configuration. 'reset' clears all custom settings and returns the terminal to default values, then automatically refreshes the page. This is useful for backing up your configuration or transferring it between devices.",
    "examples": ["settings export", "settings import", "settings reset"]
  },
  "shortcut": {
    "desc": "List or set custom keyboard shortcuts",
    "usage": "shortcut <list|set> [key] [command]",
    "man": "The shortcut command allows you to create custom keyboard shortcuts for frequently used commands. Use 'list' to see all configured shortcuts. Use 'set' followed by a key combination (like 'Ctrl+T') and a command to create a new shortcut. Key combinations are case-insensitive and can include Ctrl, Alt, and Shift modifiers. Once set, pressing the key combination will execute the associated command.",
    "examples": [
      "shortcut list",
      "shortcut set Ctrl+T clear",
      "shortcut set Alt+H help"
    ]
  },
  "note": {
    "desc": "Save a quick note",
    "usage": "note <text>",
    "man": "The note command allows you to quickly save text notes within the terminal. All arguments are combined into a single note entry with a timestamp. Notes are stored persistently in browser storage and can be viewed later using the 'notes list' command. This is useful for jotting down quick reminders, URLs, or any information you want to keep handy.",
    "examples": [
      "note Remember to update server config",
      "note API key: xyz123abc"
    ]
  },
  "notes": {
    "desc": "List all saved notes or clear them",
    "usage": "notes <list|clear>",
    "man": "The notes command manages your saved notes collection. 'list' displays all notes with their timestamps and sequential numbers. 'clear' deletes all saved notes permanently. Each note shows when it was created, making it easy to track when you saved specific information. Notes persist across terminal sessions.",
    "examples": ["notes list", "notes clear"]
  },
  "todo": {
    "desc": "Manage todo list - add, list, mark done, or clear tasks",
    "usage": "todo <add|list|done|clear> [args]",
    "man": "The todo command provides a simple task management system. 'add' creates a new task with the provided text. 'list' shows all tasks with checkboxes indicating completion status. 'done' followed by a task number marks that task as complete. 'clear' removes completed tasks by default, or use 'clear all' to remove everything. Tasks are numbered for easy reference and persist across sessions.",
    "examples": [
      "todo add Fix login bug",
      "todo list",
      "todo done 1",
      "todo clear",
      "todo clear all"
    ]
  },
  "timer": {
    "desc": "Set a countdown timer or stop active timer",
    "usage": "timer <duration|stop>",
    "man": "The timer command sets a countdown timer that will notify you when the time is up. Duration can be specified in seconds (s), minutes (m), or hours (h). For example, '10s', '5m', or '1h'. When the timer expires, you'll receive a visual notification, browser alert, and audio beep. Use 'timer stop' to cancel an active timer. Only one timer can be active at a time.",
    "examples": ["timer 25m", "timer 10s", "timer 1h", "timer stop"]
  },
  "alarm": {
    "desc": "Set an alarm for a specific time",
    "usage": "alarm <HH:MM>",
    "man": "The alarm command sets an alarm to go off at a specific time using 24-hour format. If the specified time has already passed today, the alarm will be set for the next day. When the alarm time arrives, you'll receive a visual notification, browser alert, and audio beep. The command displays how many hours and minutes until the alarm will trigger.",
    "examples": ["alarm 14:30", "alarm 09:00", "alarm 23:45"]
  },
  "remind": {
    "desc": "Set reminders - one-time or recurring (like water drinking reminder)",
    "usage": "remind <time> <task> OR remind <off|drink water>",
    "man": "The remind command sets up reminders. For one-time reminders, specify a duration (like '10m', '1h') followed by the task description. For recurring reminders, use 'remind drink water' to set up a hydration reminder every 30 minutes. Use 'remind off' to stop all active reminders. Multiple reminders can be active simultaneously, and they persist until cancelled or triggered.",
    "examples": [
      "remind 10m Check server logs",
      "remind 1h Meeting with team",
      "remind drink water",
      "remind off"
    ]
  },
  "man": {
    "desc": "Display detailed manual page for a command",
    "usage": "man <command>",
    "man": "The man command displays comprehensive documentation for the specified command. It shows the full manual entry including detailed description, usage patterns, options, and behavior. This is more detailed than the brief help text and is similar to Unix/Linux man pages. If no manual entry exists for the command, an error message is displayed.",
    "examples": ["man ls", "man grep", "man cd"]
  },
  "examples": {
    "desc": "Show usage examples for a command",
    "usage": "examples <command>",
    "man": "The examples command displays practical usage examples for the specified command. This helps you understand how to use a command in real scenarios. Each example shows the exact syntax you can type. If no examples are available for the command, a warning message is displayed. This is particularly useful when learning new commands or exploring advanced features.",
    "examples": ["examples grep", "examples find", "examples cp"]
  },
  "tutorial": {
    "desc": "Start interactive tutorial on terminal basics",
    "usage": "tutorial [topic]",
    "man": "The tutorial command provides guided lessons on using the terminal. Without arguments or with 'start', it shows an overview of available lessons. 'tutorial commands' teaches basic file operations like creating directories and files. 'tutorial shortcuts' covers keyboard shortcuts for efficient terminal use. The tutorial is interactive and designed for beginners to learn step-by-step.",
    "examples": [
      "tutorial",
      "tutorial start",
      "tutorial commands",
      "tutorial shortcuts"
    ]
  },
  "tip": {
    "desc": "Get a random terminal tip",
    "usage": "tip",
    "man": "The tip command displays a random helpful tip about using the terminal. Tips cover various features, shortcuts, and best practices. Each time you run the command, you'll see a different tip. There's also a 'tip.daily' internal function that automatically shows one tip per day when you first open the terminal.",
    "examples": ["tip"]
  },
  "tip.daily": {
    "desc": "Internal function that shows one tip per day automatically",
    "usage": "tip.daily",
    "man": "This is an internal function that automatically displays a random tip once per day when the terminal starts. It checks localStorage to see if a tip has already been shown today, and only displays a new one if it hasn't. This ensures users get helpful information without being overwhelmed by tips on every session.",
    "examples": []
  },
  "clear": {
    "desc": "Clear the terminal screen",
    "usage": "clear",
    "man": "The clear command removes all output from the terminal screen, giving you a clean slate. This is useful when the screen gets cluttered with too much output. You can also use the keyboard shortcut Ctrl+L to clear the screen. The command history is preserved even after clearing.",
    "examples": ["clear"]
  },
  "echo": {
    "desc": "Display text or message",
    "usage": "echo <text>",
    "man": "The echo command prints all provided arguments as text output to the terminal. It combines all arguments with spaces and displays them as a single line. This is useful for displaying messages, testing output, or creating simple text displays. Echo is a fundamental command available in most terminals.",
    "examples": ["echo Hello World", "echo Testing output"]
  },
  "date": {
    "desc": "Display current date",
    "usage": "date",
    "man": "The date command displays the current date in the system's locale format. It shows the day of the week, month, day, and year. This is a quick way to check today's date without leaving the terminal.",
    "examples": ["date"]
  },
  "time": {
    "desc": "Display current time",
    "usage": "time",
    "man": "The time command displays the current time in the system's locale format. It shows hours, minutes, and seconds along with AM/PM notation where applicable. This is a quick way to check the current time without leaving the terminal.",
    "examples": ["time"]
  },
  "whoami": {
    "desc": "Display current username",
    "usage": "whoami",
    "man": "The whoami command displays the currently logged-in username. This is the username you set during initial terminal setup or changed later. It's useful for confirming your identity when working with multiple terminal sessions or users.",
    "examples": ["whoami"]
  },
  "uptime": {
    "desc": "Show how long the system has been running",
    "usage": "uptime",
    "man": "The uptime command displays how long the terminal session has been active since the page was loaded. It calculates the time elapsed from when the page first loaded to the current moment and presents it in a human-readable format.",
    "examples": ["uptime"]
  },
  "history": {
    "desc": "Show command history or clear it",
    "usage": "history [-c]",
    "man": "The history command displays a numbered list of all commands you've entered in this session and previous sessions. Each command is shown with its history number. Use 'history -c' to clear all command history. History persists across sessions and is saved in browser storage. You can navigate through history using Up/Down arrow keys.",
    "examples": ["history", "history -c"]
  },
  "ls": {
    "desc": "List directory contents",
    "usage": "ls [-a] [path]",
    "man": "The ls command lists files and directories in the specified path or current directory. Directories are shown with a trailing slash. Use the -a or --all flag to show hidden files (those starting with a dot). Without a path argument, it lists the current directory. The output is color-coded with directories in blue and files in green.",
    "examples": ["ls", "ls -a", "ls /home/user", "ls --all"]
  },
  "cd": {
    "desc": "Change current directory",
    "usage": "cd [path]",
    "man": "The cd command changes your current working directory. You can use absolute paths (starting with /) or relative paths. Special paths include '..' to go up one directory, '.' for current directory, and '~' for home directory. Without arguments, cd returns you to your home directory. The prompt updates to show your new location.",
    "examples": ["cd /home", "cd ..", "cd projects", "cd"]
  },
  "sudo": {
    "desc": "Execute command with superuser privileges (simulated)",
    "usage": "sudo <command>",
    "man": "The sudo command simulates running a command with superuser/administrator privileges. It displays a password prompt (simulated) and then executes the specified command. This is a simulation for educational purposes and doesn't actually elevate privileges. It provides a realistic terminal experience similar to Unix/Linux systems.",
    "examples": ["sudo rm important.txt", "sudo mkdir /system"]
  },
  "pwd": {
    "desc": "Print current working directory path",
    "usage": "pwd",
    "man": "The pwd command displays the full absolute path of your current working directory. This helps you understand where you are in the file system hierarchy. It's particularly useful when navigating through multiple directories or when you need to reference your current location in commands.",
    "examples": ["pwd"]
  },
  "cat": {
    "desc": "Display file contents",
    "usage": "cat <file>",
    "man": "The cat command reads and displays the entire contents of the specified file. It prints the file content to the terminal output. If the file doesn't exist, an error message is shown. Cat is useful for quickly viewing text files, configuration files, or any readable content without opening an editor.",
    "examples": ["cat readme.txt", "cat /home/user/config.json"]
  },
  "touch": {
    "desc": "Create a new empty file",
    "usage": "touch <file>",
    "man": "The touch command creates a new empty file with the specified name in the current directory. If a file with that name already exists, the command will fail with an error. This is the primary way to create new files in the terminal. After creation, you can edit the file or add content using other commands.",
    "examples": ["touch newfile.txt", "touch script.js"]
  },
  "rm": {
    "desc": "Remove/delete a file",
    "usage": "rm <file>",
    "man": "The rm command permanently deletes the specified file from the current directory. This action cannot be undone. If the file doesn't exist, an error message is displayed. Use this command carefully as deleted files cannot be recovered. For directories, use the rmdir command instead.",
    "examples": ["rm oldfile.txt", "rm temp.log"]
  },
  "mkdir": {
    "desc": "Create a new directory",
    "usage": "mkdir <directory>",
    "man": "The mkdir command creates a new directory with the specified name in the current location. If a directory with that name already exists, the command fails with an error. You can then use 'cd' to enter the directory or create files inside it. Directory names should not contain special characters or spaces.",
    "examples": ["mkdir projects", "mkdir backup"]
  },
  "rmdir": {
    "desc": "Remove an empty directory",
    "usage": "rmdir <directory>",
    "man": "The rmdir command deletes the specified directory. The directory must be empty - if it contains files or subdirectories, the command will fail. This is a safety feature to prevent accidental deletion of important data. If you need to delete a directory and its contents, you must first remove all files inside it.",
    "examples": ["rmdir oldproject", "rmdir temp"]
  },
  "cp": {
    "desc": "Copy files or directories",
    "usage": "cp [-r] <source> <destination>",
    "man": "The cp command copies files or directories from source to destination. For single files, use 'cp source dest'. For directories, use the -r (recursive) flag: 'cp -r source dest'. The destination can be a new name or a path. If copying within the same directory, you must provide a different name. The original file remains unchanged.",
    "examples": [
      "cp file.txt backup.txt",
      "cp -r folder1 folder2",
      "cp document.pdf /home/user/docs/"
    ]
  },
  "mv": {
    "desc": "Move or rename files and directories",
    "usage": "mv <source> <destination>",
    "man": "The mv command moves files or directories from one location to another, or renames them if the destination is in the same directory. Unlike cp, this removes the original file from its source location. Both files and directories can be moved/renamed with the same command. The operation is atomic - either it fully succeeds or fails.",
    "examples": [
      "mv oldname.txt newname.txt",
      "mv file.txt /home/user/documents/",
      "mv folder1 folder2"
    ]
  },
  "head": {
    "desc": "Display first lines of a file",
    "usage": "head [-n <number>] <file>",
    "man": "The head command displays the first 10 lines of a file by default. Use the -n flag followed by a number to specify a different number of lines. For example, 'head -n 20 file.txt' shows the first 20 lines. This is useful for previewing large files or checking file headers without viewing the entire content.",
    "examples": ["head file.txt", "head -n 5 log.txt", "head -n 1 data.csv"]
  },
  "tail": {
    "desc": "Display last lines of a file",
    "usage": "tail [-n <number>] <file>",
    "man": "The tail command displays the last 10 lines of a file by default. Use the -n flag followed by a number to specify a different number of lines. For example, 'tail -n 20 file.txt' shows the last 20 lines. This is particularly useful for viewing log files or checking the end of large documents.",
    "examples": [
      "tail file.txt",
      "tail -n 15 error.log",
      "tail -n 5 output.txt"
    ]
  },
  "wc": {
    "desc": "Count lines, words, and characters in a file",
    "usage": "wc <file>",
    "man": "The wc (word count) command displays statistics about the specified file. It shows three numbers: line count, word count, and character count, followed by the filename. This is useful for analyzing text files, checking document length, or validating file content.",
    "examples": ["wc document.txt", "wc script.js"]
  },
  "find": {
    "desc": "Search for files by name or pattern",
    "usage": "find <pattern> OR find <path> <pattern>",
    "man": "The find command searches for files and directories matching the specified pattern. The pattern can include wildcards (* for multiple characters, ? for single character). You can optionally specify a starting path; otherwise, it searches from the current directory recursively. Results show the full path and type (file or directory) of each match with appropriate icons.",
    "examples": ["find *.txt", "find /home/user *.js", "find test*"]
  },
  "grep": {
    "desc": "Search for text patterns in files",
    "usage": "grep [-r] [-i] \"pattern\" <file|path>",
    "man": "The grep command searches for text matching a pattern within files. Use quotes around patterns with spaces. The -r flag enables recursive search through directories. The -i flag makes the search case-insensitive. Without -r, it searches a single file. Results show line numbers and the matching lines. This is essential for finding specific content in large files or codebases.",
    "examples": [
      "grep \"error\" log.txt",
      "grep -r \"function\" /home/user/project",
      "grep -i \"warning\" system.log"
    ]
  },
  "theme": {
    "desc": "Change terminal color theme",
    "usage": "theme set <name>",
    "man": "The theme command changes the terminal's visual color scheme. Available themes include 'matrix' (green on black), 'kali' (Kali Linux style), 'ubuntu' (Ubuntu terminal), 'neon-purple' (purple neon style), and 'hacker-amber' (amber monochrome). The theme change is immediate and persists across sessions. Each theme provides a different aesthetic experience while maintaining functionality.",
    "examples": ["theme set matrix", "theme set kali", "theme set neon-purple"]
  },
  "open": {
    "desc": "Open a service, website, or saved bookmark",
    "usage": "open <name>",
    "man": "The open command launches websites, services, or bookmarks in a new browser tab. It first checks system services (like gmail, github, chatgpt), then checks user-created bookmarks. The lookup is case-insensitive. If the name isn't found in either location, an error is displayed with suggestions to use 'quicklink' or 'bookmark list' commands. This provides quick access to frequently visited sites.",
    "examples": ["open gmail", "open github", "open mybookmark"]
  },
  "quicklink": {
    "desc": "List all available quick link services",
    "usage": "quicklink [search-term]",
    "man": "The quicklink command displays all available system services that can be opened with the 'open' command. Services are loaded from services.json and include popular websites and tools. You can optionally provide a search term to filter the list. Each service is shown with its name and URL. The list is alphabetically sorted for easy browsing.",
    "examples": ["quicklink", "quicklink google"]
  },
  "google": {
    "desc": "Search Google",
    "usage": "google <query>",
    "man": "The google command performs a Google search with your query in a new browser tab. All arguments are combined into the search query. This provides quick web search access directly from the terminal without manually opening a browser and typing in the search box.",
    "examples": ["google javascript tutorial", "google best practices"]
  },
  "youtube": {
    "desc": "Search YouTube",
    "usage": "youtube <query>",
    "man": "The youtube command searches YouTube for videos matching your query and opens the results in a new browser tab. All arguments are combined into the search query. This is useful for quickly finding video tutorials, music, or any YouTube content without leaving the terminal.",
    "examples": ["youtube programming tutorials", "youtube cosmic relaxation"]
  },
  "github": {
    "desc": "Search GitHub repositories",
    "usage": "github <query>",
    "man": "The github command searches GitHub for repositories, code, or users matching your query. Results open in a new browser tab showing GitHub's search results page. This is perfect for quickly finding open-source projects, code examples, or developer profiles.",
    "examples": ["github react components", "github terminal emulator"]
  },
  "stackoverflow": {
    "desc": "Search StackOverflow",
    "usage": "stackoverflow <question>",
    "man": "The stackoverflow command searches StackOverflow for questions and answers related to your query. Results open in a new tab. This is invaluable for developers looking for solutions to programming problems, code examples, or technical discussions.",
    "examples": [
      "stackoverflow javascript promises",
      "stackoverflow python list comprehension"
    ]
  },
  "wiki": {
    "desc": "Search Wikipedia",
    "usage": "wiki <topic>",
    "man": "The wiki command searches Wikipedia for articles about the specified topic. It opens Wikipedia's search results in a new browser tab. This is useful for quick fact-checking, research, or learning about any topic covered by Wikipedia.",
    "examples": ["wiki quantum computing", "wiki history of internet"]
  },
  "map": {
    "desc": "Open Google Maps for a location",
    "usage": "map <location>",
    "man": "The map command opens Google Maps in a new tab, searching for the specified location. You can provide addresses, city names, landmarks, or any location query that Google Maps understands. This is useful for quickly looking up directions or exploring locations.",
    "examples": [
      "map New York",
      "map Eiffel Tower Paris",
      "map 123 Main Street"
    ]
  },
  "translate": {
    "desc": "Translate text using Google Translate",
    "usage": "translate <text> [lang-code]",
    "man": "The translate command opens Google Translate with your text in a new browser tab. Optionally specify a language code (like 'hi', 'es', 'fr') or language pair (like 'en-hi') as the last argument. If no language is specified, Google Translate will auto-detect the source language and default to English translation. The format 'en-hi' means translate from English to Hindi.",
    "examples": [
      "translate hello world hi",
      "translate buenos dias en-es",
      "translate bonjour"
    ]
  },
  "weather": {
    "desc": "Get current weather information",
    "usage": "weather [gps]",
    "man": "The weather command fetches current weather data including temperature, conditions, humidity, and wind speed. Use 'weather gps' to get weather for your current GPS location (requires location permission). Without arguments, it attempts to fetch weather based on stored location data. Results are displayed in the terminal and also update the weather widget. Data is fetched from weatherapi.com.",
    "examples": ["weather", "weather gps"]
  },
  "crypto": {
    "desc": "Get cryptocurrency prices",
    "usage": "crypto [symbol]",
    "man": "The crypto command fetches current cryptocurrency prices. Without arguments, it defaults to Bitcoin (BTC). You can specify any cryptocurrency symbol like ETH, BTC, LTC, etc. The price is displayed in USD. This uses the apiManager to fetch real-time price data from cryptocurrency APIs.",
    "examples": ["crypto", "crypto BTC", "crypto ETH"]
  },
  "news": {
    "desc": "Fetch latest news headlines",
    "usage": "news",
    "man": "The news command retrieves the latest news headlines from a news API. It displays article titles with links to the full stories. This provides quick access to current events without leaving the terminal. The number of articles displayed depends on the API configuration.",
    "examples": ["news"]
  },
  "quote": {
    "desc": "Get an inspirational quote",
    "usage": "quote",
    "man": "The quote command fetches a random inspirational or motivational quote along with its author. Quotes are retrieved from a quotation API and displayed in an elegant format. This is a nice way to get some inspiration or wisdom during your terminal session.",
    "examples": ["quote"]
  },
  "sys.info": {
    "desc": "Display system information",
    "usage": "sys.info",
    "man": "The sys.info command shows detailed information about the browser and system environment. This includes browser name and version, operating system, screen resolution, available memory, CPU cores, language settings, and other technical details. The information is fetched from the systemMonitor module and displayed in a formatted table.",
    "examples": ["sys.info"]
  },
  "sys.log": {
    "desc": "Show system event logs",
    "usage": "sys.log",
    "man": "The sys.log command displays recent system events and activity logs maintained by the terminal. Logs include various system operations, errors, warnings, and informational messages. This is useful for debugging or understanding what actions have occurred during your session.",
    "examples": ["sys.log"]
  },
  "dev.mode.enable": {
    "desc": "Enable developer debug mode",
    "usage": "dev.mode.enable",
    "man": "The dev.mode.enable command activates developer mode, which enables additional debugging information and verbose logging. This is intended for developers or advanced users who need to troubleshoot issues or understand internal terminal operations. Once enabled, you'll see more detailed information about command execution and system events.",
    "examples": ["dev.mode.enable"]
  },
  "neofetch": {
    "desc": "Display system information with ASCII art",
    "usage": "neofetch",
    "man": "The neofetch command displays system information in a visually appealing format with ASCII art logo. It shows details like username, hostname, operating system (CyberTerm Linux), kernel version, uptime, and shell version. This command mimics the popular neofetch utility found in Linux systems and provides a stylish way to view system specs.",
    "examples": ["neofetch"]
  },
  "cowsay": {
    "desc": "Make an ASCII cow speak your message",
    "usage": "cowsay <text>",
    "man": "The cowsay command displays your message in a speech bubble with an ASCII art cow. If no text is provided, the cow says 'Moo!' by default. This is a fun, whimsical command based on the classic Unix cowsay program. It's perfect for adding humor to your terminal experience or making announcements in a creative way.",
    "examples": ["cowsay Hello World", "cowsay Terminal is awesome"]
  },
  "matrix": {
    "desc": "Toggle Matrix rain effect on/off",
    "usage": "matrix",
    "man": "The matrix command toggles the iconic Matrix-style falling characters animation in the background. When enabled, green characters cascade down the screen behind the terminal text, creating a cyberpunk aesthetic. The setting is saved and persists across sessions. Toggle it on for atmosphere or off for a cleaner look.",
    "examples": ["matrix"]
  },
  "calc": {
    "desc": "Evaluate mathematical expressions",
    "usage": "calc <expression>",
    "man": "The calc command evaluates mathematical expressions and displays the result. It supports basic operations (+, -, *, /), parentheses for order of operations, and decimal numbers. The expression is parsed safely without using eval() for security. Spaces in the expression are optional. Invalid expressions or characters will result in an error message.",
    "examples": ["calc 10 + 5 * 2", "calc (15/ 4", "calc 100 - 25"]
  },
  "bookmark": {
    "desc": "Manage custom bookmarks",
    "usage": "bookmark <add|remove|list|open> [name] [url]",
    "man": "The bookmark command manages your personal bookmark collection. 'add' saves a new bookmark with a name and URL (http/https is optional). 'remove' deletes a bookmark by name. 'list' shows all saved bookmarks. 'open' launches a bookmark in a new tab. Before adding, the command checks if the URL already exists in system services or other bookmarks to prevent duplicates. Bookmarks persist across sessions.",
    "examples": [
      "bookmark add mysite example.com",
      "bookmark list",
      "bookmark open mysite",
      "bookmark remove mysite"
    ]
  },
  "passgen": {
    "desc": "Generate a secure random password",
    "usage": "passgen <length>",
    "man": "The passgen command generates cryptographically secure random passwords. Specify the desired length (4-128 characters). The password includes uppercase, lowercase, numbers, and special characters for maximum security. Generated passwords are automatically copied to your clipboard for easy pasting. This is useful for creating strong passwords for accounts and services.",
    "examples": ["passgen 16", "passgen 32", "passgen 12"]
  },
  "alias": {
    "desc": "Create, list, or remove command shortcuts",
    "usage": "alias <set|list|remove> [name] [command]",
    "man": "The alias command creates custom shortcuts for frequently used commands or command combinations. 'set' creates a new alias - specify a short name and the full command it should execute. 'list' shows all defined aliases. 'remove' deletes an alias by name. Aliases can include arguments. For example, 'alias set ll ls -la' creates an 'll' shortcut for detailed directory listing. Aliases persist across sessions.",
    "examples": [
      "alias set ll ls -la",
      "alias set c clear",
      "alias list",
      "alias remove ll"
    ]
  },
  "fetch": {
    "desc": "Fetch content from a URL",
    "usage": "fetch <url> [-m method]",
    "man": "The fetch command retrieves content from the specified URL and displays it in the terminal. If the URL doesn't start with http/https, it's automatically prefixed with https://. The command shows the HTTP status code and determines the content type. JSON responses are formatted with proper indentation. Text responses are shown up to 500 characters to avoid overwhelming the terminal. This is useful for testing APIs or quickly viewing web content.",
    "examples": [
      "fetch api.github.com/users/octocat",
      "fetch example.com",
      "fetch https://jsonplaceholder.typicode.com/posts/1"
    ]
  },
  "tabs": {
    "desc": "Manage browser tabs - list, switch, create, close, and more",
    "usage": "tabs <action> [args]",
    "man": "The tabs command provides comprehensive browser tab management using Chrome Extension APIs. Actions include: 'list' (show all tabs with status indicators), 'switch/goto' (activate a specific tab by number), 'new' (create blank tabs or open URLs - supports bulk creation like 'tabs new 5 github.com'), 'close' (close tabs by number/range/all), 'reload' (refresh tabs), 'pin/unpin' (pin tabs), 'mute/unmute' (control audio), 'discard' (free RAM by unloading inactive tabs), 'dedup' (remove duplicate tabs). Supports ranges like '1-5' and multiple targets like '1 3 5'. Requires Chrome tabs permission.",
    "examples": [
      "tabs list",
      "tabs switch 3",
      "tabs new github.com",
      "tabs new 5",
      "tabs close 1-5",
      "tabs close all",
      "tabs pin 1",
      "tabs reload 2 4 6",
      "tabs dedup"
    ]
  },
  "history.browser": {
    "desc": "Manage browser history - list, search, open, or delete",
    "usage": "history.browser <list|search|open|rm|clear|stats> [args]",
    "man": "The history.browser command manages your browser's history using Chrome Extension APIs. 'list' shows recent history (optionally specify count like 'list 50'). 'search' finds history entries containing specific text. 'open' opens history items in new tabs (supports ranges like '1-5'). 'rm/delete' removes specific history entries. 'clear' wipes all history. 'stats' analyzes and shows your top 10 most visited sites. Results display with serial numbers, dates, times, and titles. Requires Chrome history permission.",
    "examples": [
      "history.browser list",
      "history.browser list 30",
      "history.browser search github",
      "history.browser open 1",
      "history.browser open 1-3",
      "history.browser rm 5",
      "history.browser stats",
      "history.browser clear"
    ]
  },
  "download": {
    "desc": "Manage browser downloads - start, list, pause, resume, monitor progress",
    "usage": "download <url|list|progress|pause|resume|cancel|open|show|clear> [args]",
    "man": "The download command manages browser downloads using Chrome Extension APIs. Provide a URL to start downloading a file with live progress monitoring. 'list' shows all downloads with status and progress bars. 'progress' shows live tracking for all active downloads. 'pause/resume/cancel' control specific downloads by number/range. 'open' opens downloaded files, 'show' reveals them in file manager. 'clear' removes completed downloads from the list. Supports ranges like '1-5' and 'all' for bulk operations. Downloads show real-time speed and progress with visual bars. Requires Chrome downloads permission.",
    "examples": [
      "download https://example.com/file.zip",
      "download list",
      "download progress",
      "download pause 1",
      "download resume 1-3",
      "download cancel all",
      "download open 1",
      "download show 2",
      "download clear"
    ]
  },
  "wormhole": {
    "desc": "Start or disconnect secure chat channel with another device",
    "usage": "wormhole [disconnect]",
    "man": "The wormhole command creates an encrypted peer-to-peer chat channel between devices using ntfy.sh as the relay server. Running 'wormhole' generates a unique QR code and link that another device can scan/click to join the chat. A security warning is shown before accepting connections. Once connected, you can send text messages in real-time. Type 'disconnect' in chat or use 'wormhole disconnect' to end the session. Messages show timestamps and the channel uses end-to-end encryption. Perfect for secure file sharing or quick messages between your devices.",
    "examples": ["wormhole", "wormhole disconnect"]
  }
}
